// Извличане на въведеното търсене от URL параметъра
const params = new URLSearchParams(window.location.search);
const query = params.get("query");
document.getElementById("search-query").textContent = query;

// Пример за показване на резултати
const resultsDiv = document.getElementById("results");
if (query === null || query === "") {
    resultsDiv.innerHTML = "<p>Не сте въвели дума за търсене.</p>";
	//ИТ
}else if (query.toLowerCase() === "канбан") {
    resultsDiv.innerHTML = "<p><b>Канбан</b> е име на гъвкав модел за управление на проекти и се изписва слято и с главна буква.</p>";
}else if (query.toLowerCase() === "киберсигурност") {
    resultsDiv.innerHTML = "<p><b>киберсигурност</b> е област, която защитава компютърни системи, мрежи и данни от неоторизиран достъп, атаки или унищожение, като гарантира тяхната поверителност, целостност и наличност. Думата се изписва слято, защото първата част не може да бъде използвана самостоятелно. </p>";
}else if (query.toLowerCase() === "флашпамет") {
    resultsDiv.innerHTML = "<p><b>флашпамет</b> - хардуерна част, която се изписва слято, защото съдържа представка, идваща от английски език.</p>";
}else if (query.toLowerCase() === "харддиск") {
    resultsDiv.innerHTML = "<p><b>Харддискът (HDD)</b> е запаметяващо устройство с въртящи се магнитни дискове, използвано за дълготрайно съхранение на данни.Харддискът е сложно съществително, при което едната или и двете му съставки не се употребяват самостоятелно в българския книжовен език, и се пише слято.</p>";
}else if (query.toLowerCase() === "хиперлинк") {
    resultsDiv.innerHTML = "<p><b>хиперлинк</b> - препратка към други страници, към части от същата страница, към файлове, изображения, електронна поща. Думата се изписва слято, защото първата съставна част е чуждица хипер.</p>";
} else if (query.toLowerCase() === "хипертекст") {
    resultsDiv.innerHTML = "<p><b>хипертекст</b> - метод за представяне на информация на компютър или други електронни устройства, при който части от текст, изображения или звук могат да съдържат връзка към друга информация. Думата се изписва слято, защото първата съставна част е чуждица хипер.</p>";
} else if (query.toLowerCase() === "уеб дизайн") {
    resultsDiv.innerHTML = "<p><b>уеб дизайн</b> – включва много и различни умения и дисциплини в производството и поддръжката на уеб сайтове. Думата се пише разделно, защото на английски се пише така web design и уеб се използва като определение към дизайн.</p>";
} else if (query.toLowerCase() === "уебстраница") {
    resultsDiv.innerHTML = "<p><b>уебстраница</b> – документ или информационен ресурс, който е подходящ за World Wide Web. Думата се изписва слято, защото първата съставна част пояснява втората и не се употребява като самостоятелна дума.</p>";
} else if (query.toLowerCase() === "уеб сървър") {
    resultsDiv.innerHTML = "<p><b>уеб сървър</b> – приложна програма, която позволява на даден компютър да предоставя информация на други компютри. Думата се пише разделно, защото на английски се пише така web server и уеб се използва като определение към сървър.</p>";
} else if (query.toLowerCase() === "видеоклип") {
    resultsDiv.innerHTML = "<p><b>видеоклип</b> – вид късометражен филм, който съпровожда песен. Думата може да се изписва слято или разделно в зависимост от употребата.</p>";
} else if (query.toLowerCase() === "аудиофайл") {
    resultsDiv.innerHTML = "<p><b>аудиофайл</b> – файл, съдържащ аудио информация, който може да бъде възпроизвеждан от компютър или друго устройство. Думата може да се изписва и слято, и разделно.</p>";
} else if (query.toLowerCase() === "дизюнкция") {
    resultsDiv.innerHTML = "<p><b>дизюнкция</b> – логическа операция, която съединява две или повече съждения чрез съюза „или“. От френски disjonction.</p>";
} else if (query.toLowerCase() === "конюнкция") {
    resultsDiv.innerHTML = "<p><b>конюнкция</b> – логическа операция, чрез която се образува сложно изказване от две изказвания, обединени с помощта на съюза „и“. От френски conjonction.</p>";
} else if (query.toLowerCase() === "емулатор") {
    resultsDiv.innerHTML = "<p><b>емулатор</b> – компютърна програма или устройство, което имитира поведението на друга система. От английски Emulator.</p>";
} else if (query.toLowerCase() === "фърмуер") {
    resultsDiv.innerHTML = "<p><b>фърмуер</b> – програмен код, вграден в електронни устройства, който управлява хардуера. От английски firmware.</p>";
} else if (query.toLowerCase() === "драйвер") {
    resultsDiv.innerHTML = "<p><b>драйвер</b> – софтуер, който управлява работата на хардуерните компоненти на компютъра. От английски driver.</p>";
} else if (query.toLowerCase() === "кешпамет") {
    resultsDiv.innerHTML = "<p><b>кешпамет</b> – място за съхранение на временни файлове в браузъра, което ускорява зареждането на уебстраници.</p>";
} else if (query.toLowerCase() === "домейн") {
    resultsDiv.innerHTML = "<p><b>домейн</b> – част от интернет пространството с уникално име. От английски domain.</p>";
} else if (query.toLowerCase() === "юникод") {
    resultsDiv.innerHTML = "<p><b>юникод</b> – стандарт за кодиране и обработка на текстове в различни езици. От английски Unicode.</p>";
} else if (query.toLowerCase() === "интерфейс") {
    resultsDiv.innerHTML = "<p><b>интерфейс</b> – споделена граница между два компютърни компонента, обменящи информация. От английски interface.</p>";
} else if (query.toLowerCase() === "хостинг") {
    resultsDiv.innerHTML = "<p><b>хостинг</b> – услуга, която позволява на физически лица и организации да публикуват съдържание в интернет. От английски hosting.</p>";
} else if (query.toLowerCase() === "уебинар") {
    resultsDiv.innerHTML = "<p><b>уебинар</b> – онлайн лекция, обучителна сесия или семинар, излъчван чрез уеб конференции.Думата се изписва слято, защото съдържа две съставни части от чужд произход.</p>";
} else if (query.toLowerCase() === "чат джи пи ти") {
    resultsDiv.innerHTML = "<p><b>Чат Джи Пи Ти</b> – виртуален асистент, обучен да отговаря на въпроси и да предоставя информация в реално време. Chat GPT първоначално е пуснат през юни 2020 г. В българския език при предаване на съкращения от чужд език, чиито букви се произнасят отделно, обикновено се запазва разделното изписване.</p>";

//бизнес
} else if (query.toLowerCase() === "обезщетение") {
    resultsDiv.innerHTML = "<p><b>обезщетение</b> - сумата, която застрахователят изплаща на застрахования за покриване на щетите. Изписва се с две представки О и БЕЗ.</p>";
} else if (query.toLowerCase() === "банка-издател") {
    resultsDiv.innerHTML = "<p><b>банка-издател</b> - банка, която е лицензирана от БНБ и/или от съответната международна картова организация да издава банкови карти. Полуслято се пишат сложните съществителни имена, чиито съставни части са в равноправно отношение помежду си и между тях може да се вмъкне съюзът и - банка и издател.</p>";
} else if (query.toLowerCase() === "бенефициент") {
    resultsDiv.innerHTML = "<p><b>бенефициент</b> - трета страна, в чиято полза се сключва договор или възникват права по банкова сделка. От английски език beneficiary.</p>";
} else if (query.toLowerCase() === "жилищноипотечен заем") {
    resultsDiv.innerHTML = "<p><b>жилищноипотечен заем</b> - заем от банка за строеж, подобрения и закупуване на жилища срещу ипотекиране на обекта на кредитиране. Изписва се слято и е сложносъставно прилагателно име, като между съставните части не може да се постави И.</p>";
} else if (query.toLowerCase() === "жилищноспестовен влог") {
    resultsDiv.innerHTML = "<p> <b>жилищноспестовен влог</b> - вид влог за покупка или строеж на ново жилище. Изписва се слято и е сложносъставно прилагателно име, като между съставните части не може да се постави И.</p>";
} else if (query.toLowerCase() === "импринтер") {
    resultsDiv.innerHTML = "<p> <b>импринтер</b> - устройство за извършване на плащане на стоки и услуги при търговец или за получаване на пари в брой при използване на банкова карта в режим офлайн. За разлика от ПОС терминала, при плащанията чрез импринтер информацията от магнитната лента на картата не се чете, а се снема релефен отпечатък от картата. Изписва се слято, защото е чуждица; произход: от английски imprinter.</p>";
} else if (query.toLowerCase() === "iban") {
    resultsDiv.innerHTML = "<p> <b>IBAN</b> - стандартизиран международен код на банкова сметка, използван в ЕС. У нас е задължителен от 2006 г. и се използва за плащания в страната и чужбина. Думите, изписани с абревиатура, се изписват само с главни букви.</p>";
} else if (query.toLowerCase() === "клиринг") {
    resultsDiv.innerHTML = "<p><b>клиринг</b> - система от безкасово разчитане за стоки, ценни книжа и услуги, основаваща се на зачитане на взаимните искания и задължения. Изписва се по този начин и е с произход от английски clearing.</p>";
} else if (query.toLowerCase() === "кредитоспособност") {
    resultsDiv.innerHTML = "<p><b>кредитоспособност</b> - състояние, което изразява способността на клиента на банката да върне получения заем според условията на сключения договор. Думата се изписва слято, защото двете отделни думи кредит и способност са свързани с гласна О.</p>";
} else if (query.toLowerCase() === "лизинг") {
    resultsDiv.innerHTML = "<p><b>лизинг</b> - дългосрочна аренда на машини, оборудване, транспортни или съоръжения средства. Арендодателят (лизингодателят) запазва правото си на собственост върху обекта на лизинга. Лизингът позволява на предприятията да намалят равнището на собствения капитал в източниците на финансиране. Изписва се със звучна съгласна Г в края на думата. Проверка: лизингов.</p>";
} else if (query.toLowerCase() === "офлайн терминал") {
    resultsDiv.innerHTML = "<p><b>офлайн терминал</b> - търговски терминал, който прочита и съхранява информация за карти и транзакции. Тази информация се изпраща до банката на търговеца на определен период от време. При такъв терминал обменът на данни във връзка с картата и сметката често става в момент, различен от момента на извършване на транзакцията. Думата би трябвало да се изписва слято, защото първата съставна част е чуждица, но тъй като отдавна се използва като самостоятелна дума в българския език, това сложно съществително се изписва разделно.</p>";
} else if (query.toLowerCase() === "онлайн терминал") {
    resultsDiv.innerHTML = "<p><b>онлайн терминал</b> - терминал, който работи в реално време, т.е. веднага изпраща информацията за карти и транзакции. Онлайн терминалът изисква авторизация за всяка транзакция. Думата би трябвало да се изписва слято, защото първата съставна част е чуждица, но тъй като отдавна се използва като самостоятелна дума в българския език, това сложно съществително се изписва разделно.</p>";
} else if (query.toLowerCase() === "овърдрафт") {
    resultsDiv.innerHTML = "<p><b>овърдрафт</b> - вид кредит по разплащателна сметка, чрез който клиентът има право да извършва плащания над размера на наличните средства по неговата сметка. Този кредит обикновено е със срок от една година и е дължим при поискване или с изтичане на договорения срок. Погасяването и ползването могат да се извършват многократно. Думата е чуждица и идва от английското overdraft.</p>";
} else if (query.toLowerCase() === "пос терминал") {
    resultsDiv.innerHTML = "<p><b>ПОС терминал</b> - електронен терминал (от англ. Point оf Sale – POS, точка на продажба), за приемане на банкова карта с цел иницииране и авторизация на директно, безкасово плащане за стоки и услуги при търговец, теглене на пари в брой и др. От английския израз point of sale – „точка на покупко-продажба“ пише се разделно, защото е съчетание от абревиатура и съществително.</p>";
} else if (query.toLowerCase() === "swift код на банка") {
    resultsDiv.innerHTML = "<p><b>SWIFT код на банка</b> - код от 8 или 11 знака (съкр. от англ. SWIFT BIC - SWIFT Bank Identifier Code), който е уникален за всяка банка, член на глобалната комуникационна междубанкова мрежа S.W.I.F.T. Думите, изписани с абревиатура, се изписват само с главни букви. </p>";
} else if (query.toLowerCase() === "фиксинг") {
    resultsDiv.innerHTML = "<p><b>фиксинг</b> - определеният от Централната банка курс за деня на лева към чуждестранни валути, така наречения базисен курс. Произход: от английски fixing.</p>";
} else if (query.toLowerCase() === "фючърс") {
    resultsDiv.innerHTML = "<p><b>фючърс</b> - средство за извършване на покупка или продажба на стоки и ценни книжа на фиксирана бъдеща дата независимо от пазарните и ценови изменения, настъпили към тази дата. Заемка от английски futures.</p>";
} else if (query.toLowerCase() === "хеджиране") {
    resultsDiv.innerHTML = "<p><b>хеджиране</b> - защита от загуба при кредитен риск чрез срочни сделки, като съществуващият риск по сключената сделка или позиция може да се избегне или минимизира срещу заплащане на договорената цена на хеджирането. От английски hedge, hedging.</p>";
} else if (query.toLowerCase() === "амортизация") {
    resultsDiv.innerHTML = "<p><b>амортизация</b> - начин за възстановяване на капитала, изразходване за създаване и закупуване на амортизируеми активи по пътя на постепенно пренасяне на стойността на основните средства в произвежданата продукция. От английски amortization, от френски amortisation – амортизеция, а не амуртизация.</p>";
} else if (query.toLowerCase() === "анюитет") {
    resultsDiv.innerHTML = "<p><b>анюитет</b> - категория финансови инструменти, при които най-често се изплаща една и съща сума или доход през равни интервали от време (например месец или година). Често анюитетните плащания са следствие от настъпването на определено събитие. В случая на застрахователните полици, такова плащане може да започне в резултат от настъпване на болест или смърт. От латински annuitas.</p>";
} else if (query.toLowerCase() === "автокаско") {
    resultsDiv.innerHTML = "<p><b>автокаско</b> - застраховка на автомобил срещу щети, причинени от различни събития. Думата се изписва слято, защото първата съставна част е авто.</p>";
} else if (query.toLowerCase() === "животозастраховане") {
    resultsDiv.innerHTML = "<p><b>животозастраховане</b> - застраховка, която покрива риска от смърт или инвалидност на застрахования. Думата се изписва слято, защото двете думи живот и застраховане са свързани с гласна буква О.</p>";
} else if (query.toLowerCase() === "грейс период") {
    resultsDiv.innerHTML = "<p><b>грейс период</b> - период от време, след изтичане на падежа на застрахователната премия, през който застраховката остава в сила. Изписва се разделно, защото произлиза от английски – grace period.</p>";
} else if (query.toLowerCase() === "актюер") {
    resultsDiv.innerHTML = "<p><b>актюер</b> - специалист, който прилага математически, статистически и финансови методи за оценка на риска и определяне на цените на застрахователни продукти. Изписва се с буква Ю, защото произлиза от френски – actuaire.</p>";
} else if (query.toLowerCase() === "бус") {
    resultsDiv.innerHTML = "<p><b>БУС</b> - банкови унифицирани стандарти, прилагани от българските банки по техните сделки и операции. Думите, изписани с абревиатура, се изписват само с главни букви.</p>";
} else if (query.toLowerCase() === "високорискови активи") {
    resultsDiv.innerHTML = "<p><b>високорискови активи</b> - активи на банките, включени в рисковия компонент на балансовите позиции с пълния размер на отчетната им стойност. Думата се изписва слято - сложните прилагателни имена, в които първата част е наречие и пояснява втората, която е прилагателно име.</p>";
} else if (query.toLowerCase() === "дисконт") {
    resultsDiv.innerHTML = "<p><b>дисконт</b> - отстъпката или намалението, което може да бъде направено от номинала на ценните книжа при тяхната продажба. От немски diskont.</p>";
} else if (query.toLowerCase() === "гудуил") {
    resultsDiv.innerHTML = "<p><b>гудуил</b> - превишение на стойността за покупка на предприятие. Това превишение се случва при балансовата стойност на активите му, като тя се отчита в баланса под формата на нематериален актив. От английски Goodwill.</p>";
} else if (query.toLowerCase() === "инсолвенти") {
    resultsDiv.innerHTML = "<p><b>инсолвенти</b> - клиенти на банката, които са изпаднали в състояние на неплатежеспособност. От английски insolvent – изписва се с буква О.</p>";
} else if (query.toLowerCase() === "инструментариум") {
    resultsDiv.innerHTML = "<p><b>инструментариум</b> - система от финансови средства и техники, свързани с прилагането на определена политика в областта на финансите, например съкровищни бонове, записи на заповед, секюритизация и други. Произлиза от думата инструмент.</p>";
} else if (query.toLowerCase() === "курс купува") {
    resultsDiv.innerHTML = "<p><b>курс „Купува“</b> - курсът, по който банките изкупуват чуждестранна валута срещу националната валута. Наименованието на всеки курс се изписва в кавички.</p>";
} else if (query.toLowerCase() === "курс продава") {
    resultsDiv.innerHTML = "<p><b>курс „Продава“</b> - курсът, по който банките продават чуждестранна валута срещу националната валута. Наименованието на всеки курс се изписва в кавички.</p>";
} else if (query.toLowerCase() === "купюра") {
    resultsDiv.innerHTML = "<p><b>купюра</b> - класификация на пари или ценни книжа по номиналната им стойност. От френски /coupure/.</p>";
} else if (query.toLowerCase() === "маркет мейкъри") {
    resultsDiv.innerHTML = "<p><b>маркет мейкъри</b> - фирми, които купуват и продават акции за своя собствена сметка, получавайки печалба от разликата между продажната и покупната цена. Сложна заемка от английски и се пише разделно.</p>";
} else if (query.toLowerCase() === "абандон") {
    resultsDiv.innerHTML = "<p><b>абандон</b> - отказ на застрахования от собствеността върху имуществото в полза на застрахователя срещу пълно обезщетение. Произход: от английски език abandon.</p>";
} else if (query.toLowerCase() === "платежоспособност") {
    resultsDiv.innerHTML = "<p><b>платежоспособност</b> - способността на предприятието своевременно да погасява своите краткосрочни и дългосрочни парични задължения. Думата се изписва слято. Състои се от две думи платеж и способност, обединени със свързваща гласна О.</p>";
} else if (query.toLowerCase() === "кредитоспособност") {
    resultsDiv.innerHTML = "<p><b>кредитоспособност</b> - състояние, което изразява способността на клиента на банката да върне получения заем според условията на сключения договор. Думата се изписва слято, защото двете отделни думи кредит и способност са свързани с гласна О.</p>";
} else if (query.toLowerCase() === "здравноосигурителен") {
    resultsDiv.innerHTML = "<p>Думата <b>здравноосигурителен</b> се пише слято, защото слято се пишат сложни прилагателни имена, в които първата част на думата е наречие и пояснява втората, която е прилагателно име. Двете части образуват смислово цяло.</p>";
	
	
	
	//Готвачи
} else if (query.toLowerCase() === "тиймбилдинг") {
    resultsDiv.innerHTML = "<p> <b>тиймбилдинг</b> е едно от най-подходящите и най-ефективните фирмени мероприятия за сплотяване на колектива. Пише се слято. Думата е сложно съществително име, чиито съставни части са от чужд произход и не се употребяват като самостоятелни думи в българския език.</p>";
} else if (query.toLowerCase() === "снекбар") {
    resultsDiv.innerHTML = "<p> <b>снекбар</b> – заведение за бърза закуска (най-често с пържени картофи, бира, скара). Пише се слято, защото това е сложно съществително име, чиито съставни части са от чужд произход и първата не се употребява като самостоятелна дума в българския език.</p>";
} else if (query.toLowerCase() === "фаст фууд") {
    resultsDiv.innerHTML = "<p> <b>фаст фууд</b> – превод от английски \"fast food\" е полуфабрикат, бързо хранене, бърза закуска. Изписва се разделно както е заето от английски език.</p>";
} else if (query.toLowerCase() === "кафе-аператив" || query.toLowerCase() === "кафе-сладкарница" || query.toLowerCase() === "кафе-аперитив" || query.toLowerCase() === "кафе-бар" || query.toLowerCase() === "кафе-ресторант" || query.toLowerCase() === "кафе-театър") {
    resultsDiv.innerHTML = "<p>Думите <b>кафе-аператив, кафе-сладкарница, кафе-аперитив, кафе-бар, кафе-ресторант, кафе-театър</b> – пишат се полуслято, защото полуслято се пишат сложните съществителни имена, чиито съставни части са в равноправно отношение помежду си /между тях може да се вмъкне съюзът И/ - кафе И аператив, кафе И сладкарница, кафе И бар, кафе И ресторант, кафе И театър.</p>";
} else if (query.toLowerCase() === "кафе пауза" || query.toLowerCase() === "кафепауза" || query.toLowerCase() === "кафе автомат" || query.toLowerCase() === "кафеавтомат") {
    resultsDiv.innerHTML = "<p>Думите <b>кафе пауза / кафепауза, кафе автомат / кафеавтомат</b> се пишат разделно или слято – кафепауза/ кафе пауза, кафеавтомат/ кафе автомат, защото първата част на сложното съществително име пояснява втората, двете (или само първата) имат чужд произход и се употребяват като самостоятелни думи.</p>";
} else if (query.toLowerCase() === "сосиера") {
    resultsDiv.innerHTML = "<p><b>сосиера</b> – порцеланов съд за сос. Изписва се сОсиера с корен на думата сос.</p>";
} else if (query.toLowerCase() === "високоалкохолни напитки") {
    resultsDiv.innerHTML = "<p><b>високоалкохолни напитки</b> –</p>";
} else if (query.toLowerCase() === "минибар") {
    resultsDiv.innerHTML = "<p><b>минибар</b> – малък хладилник, обикновено разположен в хотелската стая, който съдържа напитки, ядки и други консумативи, които могат да бъдат използвани от гостите. Минибарът е оборудван с автоматична система за отчитане на консумираните стоки и се използва за удобство на гостите. Думата е сложно съществително име и се пише слято, защото е образувано от съкратено прилагателно име /мини, минимален/ и съществително име /бар/.</p>";
} else if (query.toLowerCase() === "нескафе") {
    resultsDiv.innerHTML = "<p><b>нескафе</b> – разновидност кафе, което се изписва слято, защото е заемка от английски Nescafe.</p>";
} else if (query.toLowerCase() === "млечнокисело сирене") {
    resultsDiv.innerHTML = "<p> <b>млечнокисело сирене</b> – сложното прилагателно се изписва слято, защото е образувано от прилагателни имена, при които едното е подчинено на другото.</p>";
} else if (query.toLowerCase() === "тет-а-тет") {
    resultsDiv.innerHTML = "<p><b>тет-а-тет</b> - под влияние на графичното изписване във френския език, откъдето е заета (tête-à-tête). Те-а-тет (на френски: tête à tête – глава срещу глава, един срещу друг) може да се отнася за: тет-а-тет – разговор на четири очи тет-а-тет – мебел за 2 души тет-а-тет – вид ястие за закуска тет-а-тет – дълга тясна покривка за маса (непокриваща отстрани целия плот) Tête à Tête – оперен театър в Лондон.</p>";
} else if (query.toLowerCase() === "куркума") {
    resultsDiv.innerHTML = "<p><b>куркума</b> - наричана индийското злато и е една от най-известните и ценени подправки в света. Куркума от латински (Curcuma longa), наричана още индийски шафран и от корена му, след изсушаване и стриване на прах, се получава прочутата яркожълта подправка, запазена марка на много азиатски и арабски кухни.</p>";
} else if (query.toLowerCase() === "курбан чорба") {
    resultsDiv.innerHTML = "<p><b>курбан чорба</b> - Думата е заета от арабски чрез турски – kurban. Курбан чорба е традиционно българско ястие, което се приготвя от агнешко месо, агнешки дреболии, кромид лук, сладки и люти чушки, моркови, домати, яйца, ориз, магданоз, джоджен, черен пипер, червен пипер, сол.</p>";
} else if (query.toLowerCase() === "кьопоолу") {
    resultsDiv.innerHTML = "<p><b>кьопоолу</b> - Пише се с две букви О - кьопоолу. Думата е заета от турски – köpoğlu.</p>";
} else if (query.toLowerCase() === "карначе") {
    resultsDiv.innerHTML = "<p><b>карначе</b> - пише се кАрначе, мн.ч. карначета. Думата е заета от румънски – cîrnaţ, но има латински корени (caro, -rnis ’месо’).</p>";
} else if (query.toLowerCase() === "крем-карамел") {
    resultsDiv.innerHTML = "<p><b>крем-карамел</b> - пише полуслято, защото се състои от две съществителни имена, второто от които е подчинено на първото и го пояснява: кремът е с карамел.</p>";
} else if (query.toLowerCase() === "чийзкейк") {
    resultsDiv.innerHTML = "<p><b>чийзкейк</b> - се пише слято, защото това е сложно съществително име, чиито съставни части са от чужд произход и първата от тях не се употребява като самостоятелна дума в българския език. Думата е заета от английски – cheesecake.</p>";
} else if (query.toLowerCase() === "шамфъстък") {
    resultsDiv.innerHTML = "<p><b>шамфъстък</b> - пише се слято – шамфъстък, защото това е сложно съществително име, чиито съставни части са от чужд произход и първата от тях не се употребява като самостоятелна дума в българския език. Родината му е град Ашам, което е Дамаск. Шамфъстък е фистикия, тоест фистачио от Дамаск- мястото, откъдето се смята, че произхождат и са най-вкусните и качествените ядки.</p>";
} else if (query.toLowerCase() === "миш-маш") {
    resultsDiv.innerHTML = "<p><b>миш-маш</b> - се пише полуслято. Думата е заета от немски – Mischmasch и втората част може да се членува, докато първата не се променя.</p>";
} else if (query.toLowerCase() === "айскафе") {
    resultsDiv.innerHTML = "<p><b>айскафе</b> - се пише слято, защото това е сложно съществително име, чиито съставки са от чужд произход и първата от тях не се употребява като самостоятелна дума в българския език. Думата е заета от немски – Eiskaffee.</p>";
} else if (query.toLowerCase() === "млечнокисело сирене") {
    resultsDiv.innerHTML = "<p><b>млечнокисело сирене</b> - е сложното прилагателно се изписва слято, защото е образувано от прилагателни имена, при които едното е подчинено на другото.</p>";
} else if (query.toLowerCase() === "сурово-солени продукти") {
    resultsDiv.innerHTML = "<p><b>сурово-солени продукти</b> - се изписват полуслято. Това са сложни прилагателни, съставени от две равноправни основи.</p>";
} else if (query.toLowerCase() === "варено-пушени колбаси") {
    resultsDiv.innerHTML = "<p><b>варено-пушени колбаси</b> - се изписват полуслято. Това са сложни прилагателни, съставени от две равноправни основи.</p>";
} else if (query.toLowerCase() === "етеричномаслени храни") {
    resultsDiv.innerHTML = "<p><b>етеричномаслени храни</b> - пише се слято, защото е образувано от съчетание на прилагателно и съществително име – етерично и масло.</p>";
} else if (query.toLowerCase() === "лимонтузу") {
    resultsDiv.innerHTML = "<p><b>лимонтузу</b> – пише се с У - лимонтузу. Думата е заета от турски – limontuzu (limon ’лимон’ + tuz ’сол’).</p>";
} else if (query.toLowerCase() === "фламбирам") {
    resultsDiv.innerHTML = "<p><b>фламбирам</b> - се изписва с М в средата, защото е заемка от немски flambieren.</p>";
} else if (query.toLowerCase() === "поширане") {
    resultsDiv.innerHTML = "<p><b>поширане</b> - правописът на думата не е нормиран. Пишете пошира. Думата е заета от френски – pochér. Пош е кухненски уред с фуния и мех от плат за крем, с който сместа се нанася лесно върху блат.</p>";
} else if (query.toLowerCase() === "бутертесто") {
    resultsDiv.innerHTML = "<p><b>бутертесто</b> - се пише слято, защото това е сложно съществително име с първа съставка от чужд произход и не се употребява като самостоятелна дума в българския език (нем. Butter ’масло’).</p>";
} else if (query.toLowerCase() === "крем супа") {
    resultsDiv.innerHTML = "<p><b>крем супа</b> – може да се пише слято – кремсупа, или разделно – крем супа, защото първата съставна част на сложното съществително име пояснява втората, двете или само първата имат чужд произход и се употребяват като самостоятелни думи.</p>";
} else if (query.toLowerCase() === "огретен") {
    resultsDiv.innerHTML = "<p><b>огретен</b> – всяко ястие, което е залято или покрито отгоре със сирене (мляко или сметана) или галета, смесени с бучки масло и приготвено във фурна или под грил. Терминът „au gratin“ или „gratinée“, откъдето идва и българското огретен, е за всички ястия, приготвени по този начин. Огретенът се приготвя в специални кръгли или овални огнеупорни съдове, наричани gratin.</p>";
} else if (query.toLowerCase() === "ошав") {
    resultsDiv.innerHTML = "<p><b>ошав</b> - пише се ОшаВ. Думата е заета от персийски чрез турски – hoşaf. Правописът на думата в български се разграничава от изписването на турски.</p>";
} else if (query.toLowerCase() === "туроператорска фирма") {
    resultsDiv.innerHTML = "<p><b>туроператорска фирма</b> - думата е сложно съществително. Тя се пише слято, тъй като първата ѝ съставка пояснява и конкретизира втората.</p>";
} else if (query.toLowerCase() === "спортно-оздравителна гимнастика") {
    resultsDiv.innerHTML = "<p><b>спортно-оздравителна гимнастика</b> – пише се полуслято, защото сложните прилагателни имена, чиито съставни части са в равноправно отношение и между тях може да се вмъкне съюзът и – спортен и оздравителен.</p>";
} else if (query.toLowerCase() === "уелнес хранене") {
    resultsDiv.innerHTML = "<p><b>уелнес хранене</b> - помага не само за сваляне на килограми, но и това човек да придобие правилните за него навици. От английски wellness.</p>";
} else if (query.toLowerCase() === "консоме") {
    resultsDiv.innerHTML = "<p><b>консоме</b> - е силен бульон, който се приготвя от кокали, които врат много дълго време на ниска температура. Поднася се самостоятелно като избистрена светла супа, придружена от крем от сгъстени яйца. Чуждица – Consomme.</p>";
} else if (query.toLowerCase() === "олинклузив") {
    resultsDiv.innerHTML = "<p><b>олинклузив</b> - се пише слято, защото това е сложна дума, чиито съставни части са от чужд произход и не се употребяват самостоятелно в българския език.</p>";
} else if (query.toLowerCase() === "рент-а-кар") {
    resultsDiv.innerHTML = "<p><b>рент-а-кар</b> - коли под наем, от англ. rent a car е услуга, при която моторно превозно средство се отдава срещу заплащане за определен период от време, който може да варира от часове до седмици, месеци, а по изключение и за по-дълъг период. Думата рент-а-кар се пише полуслято, с два дефиса.</p>";
} else if (query.toLowerCase() === "помощник-готвач") {
    resultsDiv.innerHTML = "<p><b>помощник-готвач</b> се пише полуслято, защото се състои от две съществителни имена и второто пояснява първото, а при членуване се променя само второто съществително име</p>";







//Пароними
}else if (query.toLowerCase() === "тулумба") {
    resultsDiv.innerHTML = "<p>Тулумба е традиционно ястие - популярен десерт в балканската и източната кухня, направен от пържено тесто, напоено със захарен сироп. <br> <img src='tulumba.webp'style='margin-top: 10px; width: 200px; height: auto;'/><br> Може да бъде объркана с думата: <a href= 'search.html?query=толумба'>Толумба</a>  </p>";
}else if (query.toLowerCase() === "толумба") {
    resultsDiv.innerHTML = "<p>Толумба означава красив глинен съд  <br> <img src='tolumba.webp'style='margin-top: 10px; width: 200px; height: auto;' /> <br>Може да бъде объркана с думата: <a href= 'search.html?query=тулумба'>Тулумба</a>  </p>";
}else if (query.toLowerCase() === "скраб") {
    resultsDiv.innerHTML = "<p>Скраб е козметичен продукт, използван за ексфолиране на кожата  <br> <img src='scrab.webp'style='margin-top: 20px; width: 200px; height: auto;' /> <br>Може да бъде объркана с думата: <a href= 'search.html?query=скрап'>скрап</a>  </p>";
}else if (query.toLowerCase() === "скрап") {
    resultsDiv.innerHTML = "<p>Терминът  скрап се използва за обозначаване на отпадъчни материали, най-често метални, които могат да бъдат рециклирани или повторно използвани.  <br> <img src='scrap.webp'style='margin-top: 20px; width: 200px; height: auto;' /> <br>Може да бъде объркана с думата: <a href= 'search.html?query=скраб'>Скраб</a>  </p>";
}else if (query.toLowerCase() === "крутон") {
    resultsDiv.innerHTML = "<p>Крутон - препечени или пържени малки парченца хляб,нарязяани на кубчета, поднасяни като гарнитура към ястия.<br> <img src='kruton.webp'style='margin-top: 20px; width: 200px; height: auto;' /> <br>Може да бъде объркана с думата: <a href= 'search.html?query=кротон'>кротон</a>  </p>";
}else if (query.toLowerCase() === "кротон") {
    resultsDiv.innerHTML = "<p>Кротон - декоративно растение с пъстри листа.<br> <img src='kroton.webp'style='margin-top: 20px; width: 200px; height: auto;' />  <br>Може да бъде объркана с думата: <a href= 'search.html?query=крутон'>крутон</a>  </p>";
}else if (query.toLowerCase() === "мас") {
    resultsDiv.innerHTML = "<p> Мас - животинска мазнина, използвана в кулинарията. <br> <img src='mas.webp'style='margin-top: 20px; width: 200px; height: auto;' /> <br>Може да бъде объркана с думата: <a href= 'search.html?query=маз'>маз</a>  </p>";
}else if (query.toLowerCase() === "маз") {
    resultsDiv.innerHTML = "Маз - лекарствен продукт с мазна основа, предназначен за външно приложение върху кожата или лигавиците. <br> <img src='maz.webp'style='margin-top: 20px; width: 200px; height: auto;' /><br>Може да бъде объркана с думата: <a href= 'search.html?query=мас'>мас</a>  </p>";
}else if (query.toLowerCase() === "муниции") {
    resultsDiv.innerHTML = "<p>Муниции - боеприпаси като патрони, гранати, снаряди и други средства за въоръжение. <br><img src='municii.webp'style='margin-top: 20px; width: 200px; height: auto;' /> <br>Може да бъде объркана с думата: <a href= 'search.html?query=амуниции'>амуниции</a>  </p>";
}else if (query.toLowerCase() === "амуниции") {
    resultsDiv.innerHTML = "<p>Думата амуниции, означава: <br> 1. Приспособления, използвани за оседлаване или впрягане на коне..<br>2.Оборудване, носено от военнослужещи или въоръжени лица, което не включва дрехи и оръжие.. <br><img src='amunicii.webp'style='margin-top: 20px; width: 200px; height: auto;' /> <br>Може да бъде объркана с думата: <a href= 'search.html?query=муниции'>муниции</a>  </p>";
}else if (query.toLowerCase() === "тегел") {
    resultsDiv.innerHTML = "<p> Тегел - линия от бодове, направени с шевна машина по права линия.<br><img src='tegel.webp'style='margin-top: 20px; width: 200px; height: auto;' /><br>Може да бъде объркана с думата: <a href= 'search.html?query=тигел'>тигел</a>  </p>";
}else if (query.toLowerCase() === "тигел") {
    resultsDiv.innerHTML = "<p>Тигел - огнеупорен съд, използван за топене и обработка на различни материали при високи температури.<br><img src='tigel.webp'style='margin-top: 20px; width: 200px; height: auto;' /> <br>Може да бъде объркана с думата: <a href= 'search.html?query=тегел'>тегел</a>  </p>";
}else if (query.toLowerCase() === "стенд") {
    resultsDiv.innerHTML = "<p>Стенд означава: <br>1. Специално оборудвано място за диагностика, изпитване или регулиране на машини и устройства. <br>  2. Устройство, използвано при сглобяване или заваряване на метални конструкции.. <br><img src='stend.webp'style='margin-top: 20px; width: 200px; height: auto;' /><br>Може да бъде объркана с думата: <a href= 'search.html?query=стент'>стент</a>  </p>";
}else if (query.toLowerCase() === "стент") {
    resultsDiv.innerHTML = "<p>Стент - малка тръбовидна конструкция, която поддържа отворени кръвоносни съдове или други кухи органи в тялото. <br> <img src='stent.webp'style='margin-top: 20px; width: 200px; height: auto;' /> <br>Може да бъде объркана с думата: <a href= 'search.html?query=стенд'>стенд</a>  </p>";
}else if (query.toLowerCase() === "комплимент") {
    resultsDiv.innerHTML = "<p>Комплимент - похвални думи, отправени към някого с цел да му доставят удоволствие или да го поласкаят.<br><img src='kompliment.webp'style='margin-top: 20px; width: 200px; height: auto;' /> <br>Може да бъде объркана с думата: <a href= 'search.html?query=комплемент'>комплемент</a>  </p>";
}else if (query.toLowerCase() === "комплемент") {
    resultsDiv.innerHTML = "<p>Комплемент - белтъчно вещество, което е нормална съставка в човешкия и животинския кръвен серум.<br> <img src='komplement.webp'style='margin-top: 20px; width: 200px; height: auto;' /> <br>Може да бъде объркана с думата: <a href= 'search.html?query=комплимент'>комплимент</a>  </p>";
}else if (query.toLowerCase() === "климатизирам") {
    resultsDiv.innerHTML = "<p>Климатизирам - регулирам състоянието на въздуха в затворено помещение.<br><img src='klimatiziram.webp'style='margin-top: 20px; width: 200px; height: auto;' />  <br>Може да бъде объркана с думата: <a href= 'search.html?query=аклиматизирам'>аклиматизирам</a>  </p>";
}else if (query.toLowerCase() === "аклиматизирам") {
    resultsDiv.innerHTML = "<p>Аклиматизирам (се) - приспособявам (се) към нови климатични или други условия за живот.<br><img src='aklimatiziram.webp'style='margin-top: 20px; width: 200px; height: auto;' /> <br>Може да бъде объркана с думата: <a href= 'search.html?query=климатизирам'>климатизирам</a>  </p>";
}else if (query.toLowerCase() === "марула") {
    resultsDiv.innerHTML = "<p>Марула - вид дърво с широка корона, което вирее в Африка; известно също като склерокария или слонско дърво. <br><img src='marula.webp'style='margin-top: 20px; width: 200px; height: auto;' /> <br>Може да бъде объркана с думата: <a href= 'search.html?query=маруля'>маруля</a>  </p>";
}else if (query.toLowerCase() === "маруля") {
    resultsDiv.innerHTML = "<p>Маруля - зеленчуково растение с големи листа, които се използват основно за приготвяне на салати.<br><img src='marulq.webp'style='margin-top: 20px; width: 200px; height: auto;' />  <br>Може да бъде объркана с думата: <a href= 'search.html?query=марула'>марула</a>  </p>";
}else if (query.toLowerCase() === "ларва") {
    resultsDiv.innerHTML = "<p>Ларва - начален стадий в развитието на някои животни, който се различава значително от възрастната форма. <br><img src='larva.webp'style='margin-top: 20px; width: 200px; height: auto;' /> <br>Може да бъде объркана с думата: <a href= 'search.html?query=лавра'>лавра</a>  </p>";
}else if (query.toLowerCase() === "лавра") {
    resultsDiv.innerHTML = "<p>Лавра - голям православен привилегирован манастир, обикновено с висок статут и влияние в църковната йерархия. Може да бъде и почетна титла, дадена на най-старите и най-уважавани манастири.  <br><img src='lavra.webp'style='margin-top: 20px; width: 200px; height: auto;' /><br>Може да бъде объркана с думата: <a href= 'search.html?query=ларва'>ларва</a>  </p>";
}else if (query.toLowerCase() === "шпиц") {
    resultsDiv.innerHTML = "<p>Шпиц - порода куче с гъста козина и заострена муцуна. <br><img src='shpic.webp'style='margin-top: 20px; width: 200px; height: auto;' /> <br>Може да бъде объркана с думата: <a href= 'search.html?query=шприц'>шприц</a>  </p>";
}else if (query.toLowerCase() === "шприц") {
    resultsDiv.innerHTML = "<p>Шприц -уред за разпръскване на течности под налягане. <br><img src='shpric.webp'style='margin-top: 20px; width: 200px; height: auto;' /> <br>Може да бъде объркана с думата: <a href= 'search.html?query=шпиц'>шпиц</a>  </p>";
}else if (query.toLowerCase() === "обращение") {
    resultsDiv.innerHTML = "<p>Обращение е финансов термин и се отнася до процеса на обмяна на парични средства и стоки, тоест до икономическия оборот. <br><img src='obrashtenie.webp'style='margin-top: 20px; width: 200px; height: auto;' /> <br>Може да бъде объркана с думата: <a href= 'search.html?query=обръщение'>обръщение</a>  </p>";
}else if (query.toLowerCase() === "обръщение") {
    resultsDiv.innerHTML = "<p>Обръщение означава дума или израз, с който говорещият се насочва към друго лице, както и призив или възвание. <br><img src='obryshtenie.webp'style='margin-top: 20px; width: 200px; height: auto;' /> <br>Може да бъде объркана с думата: <a href= 'search.html?query=обращение'>обращение</a>  </p>";
}else if (query.toLowerCase() === "долмени") {
    resultsDiv.innerHTML = "<p>Долмени са погребални каменни съоръжения<br><img src='dolmeni.webp'style='dolmeni-top: 20px; width: 200px; height: auto;' />  <br>Може да бъде объркана с думата: <a href= 'search.html?query=доломити'>доломити</a>  </p>";
}else if (query.toLowerCase() === "доломити") {
    resultsDiv.innerHTML = "<p>Доломити са диментни карбонатни скали, съдържащи с по 50% минералите долмит и калцит.<br><img src='dolomiti.webp'style='margin-top: 20px; width: 200px; height: auto;' /> <br>Може да бъде объркана с думата: <a href= 'search.html?query=долмени'>долмени</a>  </p>";

//други
} else if (query.toLowerCase() === "сглобка") {
    resultsDiv.innerHTML = "<p><b>сглобка</b> е образувана от представка<b> с-</b> и корен <b>–глоб-</b></p>";
} else if (query.toLowerCase() === "църковнославянски") {
    resultsDiv.innerHTML = "<p><b>църковнославянски</b> е сложно прилагателно име, което се пише слято</p>";
} else if (query.toLowerCase() === "орисник") {
    resultsDiv.innerHTML = "<p><b>орисник</b> – проверка: орис <b>(без т)</b></p>";
} else if (query.toLowerCase() === "националноосвободително") {
    resultsDiv.innerHTML = "<p><b>националноосвободително</b> е сложно прилагателно име, което се пише слято</p>";
} else if (query.toLowerCase() === "гъркоман" || query.toLowerCase() === "гъркофил") {
    resultsDiv.innerHTML = "<p><b>" + query + "</b> – разпален привърженик на всичко гръцко, гърчеещ се българин</p>";
} else if (["библиотекаря", "пожарникаря", "учителя", "юбиляря", "жътваря", "санитаря", "планинаря"].includes(query.toLowerCase())) {
    resultsDiv.innerHTML = "<p><b>" + query + "</b> – думи с наставка <b>–ар и –тел</b>, които се членуват с <b>я и ят</b></p>";
} else if (["научнопопулярен", "научнофантастичен", "научноизследователски", "научностатистически"].includes(query.toLowerCase())) {
    resultsDiv.innerHTML = "<p><b>" + query + "</b> – прилагателни имена, които се изписват слято</p>";
} else if (query.toLowerCase() === "чуждоезичен" || query.toLowerCase() === "многоезичен") {
    resultsDiv.innerHTML = "<p><b>" + query + "</b> – прилагателни имена, които се изписват слято</p>";
} else if (query.toLowerCase() === "административнонаказателна") {
    resultsDiv.innerHTML = "<p><b>административнонаказателна</b> е прилагателно име, което се изписва слято</p>";
} else if (query.toLowerCase() === "административно-териториален") {
    resultsDiv.innerHTML = "<p><b>административно-териториален</b> е сложно прилагателно име, в което отделните части са в равноправно отношение</p>";
} else if (query.toLowerCase() === "хранително-вкусов") {
    resultsDiv.innerHTML = "<p><b>хранително-вкусов</b> е сложно прилагателно име, в което отделните части са в равноправно отношение</p>";
} else if (query.toLowerCase() === "сърдечносъдова") {
    resultsDiv.innerHTML = "<p><b>сърдечносъдова</b> е сложно прилагателно име, което се изписва слято</p>";
} else if (query.toLowerCase() === "информационно-комуникационна") {
    resultsDiv.innerHTML = "<p><b>информационно-комуникационна</b> е сложно прилагателно име, в което отделните части са в равнозначно отношение</p>";
} else if (query.toLowerCase() === "потисник") {
    resultsDiv.innerHTML = "<p><b>потисник</b> – думата се изписва без <b>д</b>, защото представката е <b>по-</b></p>";
} else if (query.toLowerCase() === "претекст") {
    resultsDiv.innerHTML = "<p><b>претекст</b> – думата се пише без <b>д</b>, защото е френска: pretexte</p>";
} else if (query.toLowerCase() === "заимствам") {
    resultsDiv.innerHTML = "<p><b>заимствам</b> – изписва се без <b>в</b> в началото, защото представката е <b>за-</b></p>";
} else if (query.toLowerCase() === "физикохимия") {
    resultsDiv.innerHTML = "<p><b>физикохимия</b> – пише се слято, защото е бинарна наука, обединяваща две науки</p>";
} else if (query.toLowerCase() === "фланелка") {
    resultsDiv.innerHTML = "<p><b>фланелка</b> – от френски език: flanelle</p>";
} else if (query.toLowerCase() === "анцуг") {
    resultsDiv.innerHTML = "<p><b>анцуг</b> – от немски: anzug</p>";
} else if (query.toLowerCase() === "безпокоя") {
    resultsDiv.innerHTML = "<p><b>безпокоя</b> – образувана е от представка <b>без- и корен -покой</b>-</p>";
} else if (query.toLowerCase() === "пластилин") {
    resultsDiv.innerHTML = "<p><b>пластилин</b> е дума, заета от италиански plastilina</p>";
} else if (query.toLowerCase() === "съжалявам") {
    resultsDiv.innerHTML = "<p><b>съжалявам</b> – корен на думата е <b>-жал-</b></p>";
} else if (query.toLowerCase() === "впечатление") {
    resultsDiv.innerHTML = "<p><b>впечатление</b> – корен на думата е <b>-печат-</b></p>";
} else if (query.toLowerCase() === "лиана") {
    resultsDiv.innerHTML = "<p><b>лиана</b> е дума, заета от френски liane (сноп)</p>";
} else if (query.toLowerCase() === "улук") {
    resultsDiv.innerHTML = "<p><b>улук</b> е дума, заета от турски oluk</p>";
} else if (query.toLowerCase() === "лавка") {
    resultsDiv.innerHTML = "<p><b>лавка</b> – проверка: лавица</p>";
} else if (query.toLowerCase() === "вкъщи") {
    resultsDiv.innerHTML = "<p><b>вкъщи</b> се пише слято, ако носи функцията на наречие за място</p>";
} else if (query.toLowerCase() === "отвертка") {
    resultsDiv.innerHTML = "<p><b>отвертка</b> е дума, заета от руски отвёртка</p>";
} else if (query.toLowerCase() === "кренвирш") {
    resultsDiv.innerHTML = "<p><b>кренвирш</b> е дума, заета от австрийски Krenwürstchen</p>";
} else if (query.toLowerCase() === "фоайе") {
    resultsDiv.innerHTML = "<p><b>фоайе</b> е дума, заета от френски foyer</p>";
} else if (query.toLowerCase() === "калъфка") {
    resultsDiv.innerHTML = "<p><b>калъфка</b> - проверка: калъфи</p>";
} else if (query.toLowerCase() === "пантофка") {
    resultsDiv.innerHTML = "<p><b>пантофка</b> - проверка: пантофи</p>";
} else if (query.toLowerCase() === "анекдот") {
    resultsDiv.innerHTML = "<p><b>анекдот</b> - от английски anecdote</p>";
} else if (query.toLowerCase() === "двойствен") {
    resultsDiv.innerHTML = "<p><b>двойствен</b> - проверка: двоен</p>";
} else if (query.toLowerCase() === "пустошта") {
    resultsDiv.innerHTML = "<p><b>пустошта</b> - проверка: пустош + та</p>";
} else if (query.toLowerCase() === "историко-филологически") {
    resultsDiv.innerHTML = "<p><b>историко-филологически</b> - изписва се полуслято, защото между двете части на думата може да се постави гласна И</p>";
} else if (query.toLowerCase() === "островърх") {
    resultsDiv.innerHTML = "<p><b>островърх</b> - в основната форма се изписва връх (съчетание <b>-ръ-</b>), но в останалите форми на думата се променят местата им и стават <b>-ър</b>.</p>";
} else if (query.toLowerCase() === "химико-фармацевтична") {
    resultsDiv.innerHTML = "<p><b>химико-фармацевтична</b> - пише се полуслято, защото двете части на думата са равнопоставени по значение</p>";
} else if (query.toLowerCase() === "сградостроителен") {
    resultsDiv.innerHTML = "<p><b>сградостроителен</b> - пише се слято, защото втората част на думата пояснява първата част</p>";
} else if (query.toLowerCase() === "пунктуация") {
    resultsDiv.innerHTML = "<p><b>пунктуация</b> - от латински Punctum</p>";
} else if (query.toLowerCase() === "акумулатор") {
    resultsDiv.innerHTML = "<p><b>акумулатор</b> - от латински accumulator</p>";
} else if (query.toLowerCase() === "генерал-губернатор") {
    resultsDiv.innerHTML = "<p><b>генерал-губернатор</b> - изписва се полуслято, защото се състои от две съществителни имена, при които второто пояснява първото</p>";
} else if (query.toLowerCase() === "възпирам") {
    resultsDiv.innerHTML = "<p><b>възпирам</b> - думата се изписва без буква С в средата, защото представката е <b>въз-</b> и корен <b>-пир-</b></p>";
} else if (query.toLowerCase() === "световноизвестни") {
    resultsDiv.innerHTML = "<p><b>световноизвестни</b> - изписва се слято, защото първата част е наречие, пояснява втората част - прилагателно име и образуват едно цяло по смисъл</p>";
} else if (query.toLowerCase() === "безнадеждност") {
    resultsDiv.innerHTML = "<p><b>безнадеждност</b> - думата е образувана от представка <b>без-</b> и корен <b>-надежд-</b></p>";
} else if (query.toLowerCase() === "живописта") {
    resultsDiv.innerHTML = "<p><b>живописта</b> - основна форма на думата е живопис и при членуване се изписва определителен член - та (само една буква Т)</p>";
} else if (query.toLowerCase() === "еликсир") {
    resultsDiv.innerHTML = "<p><b>еликсир</b> - от арабски al-iksir</p>";
} else if (query.toLowerCase() === "именик") {
    resultsDiv.innerHTML = "<p><b>именик</b> - основна форма имен <b>- Н</b>не се удвоява</p>";
} else if (query.toLowerCase() === "рожденик") {
    resultsDiv.innerHTML = "<p><b>рожденик</b> - основна форма рожден <b>- Н</b> не се удвоява</p>";
} else if (query.toLowerCase() === "културно-просветна") {
    resultsDiv.innerHTML = "<p><b>културно-просветна</b> - изписва се полуслято, защото двете съставни части са равноправни по смисъл</p>";
} else if (query.toLowerCase() === "посланик") {
    resultsDiv.innerHTML = "<p><b>посланик</b> - изписва се с едно<b> Н</b> в наставката</p>";
} else if (query.toLowerCase() === "племенник") {
    resultsDiv.innerHTML = "<p><b>племенник</b> - изписва се с двойно <b>НН</b>, защото основата е племен и наставка <b>-ник</b></p>";
} else if (query.toLowerCase() === "кюмюр") {
    resultsDiv.innerHTML = "<p><b>кюмюр</b> - въглища, заета от турски kymyr</p>";
} else if (query.toLowerCase() === "фасонка") {
    resultsDiv.innerHTML = "<p><b>фасонка</b> - заета от немски Fassung</p>";
} else if (query.toLowerCase() === "риванол") {
    resultsDiv.innerHTML = "<p><b>риванол</b> - заета от немски Rivanol</p>";
} else if (query.toLowerCase() === "папийонка") {
    resultsDiv.innerHTML = "<p><b>папийонка</b> - заета от френски papillon</p>";
} else if (query.toLowerCase() === "подплатявам") {
    resultsDiv.innerHTML = "<p><b>подплатявам</b> - образувана е от представка <b>под-</b> и корен <b>-плат-</b></p>";
} else if (query.toLowerCase() === "въплъщавам") {
    resultsDiv.innerHTML = "<p><b>въплъщавам</b> - образувана е от представка<b> въ-</b> и корен <b>-плът-</b></p>";
} else if (query.toLowerCase() === "научнофантастичен") {
    resultsDiv.innerHTML = "<p><b>научнофантастичен</b> - изписва се слято, защото е съчетание от прилагателно име и съществително име (фантастика)</p>";
} else if (query.toLowerCase() === "контролно-пропускателен") {
    resultsDiv.innerHTML = "<p><b>контролно-пропускателен</b> - изписва се без <b>В</b> във втората част, защото формата на глагола е пропускам</p>";
} else if (query.toLowerCase() === "будка") {
    resultsDiv.innerHTML = "<p><b>будка</b> - заета от немски Bude</p>";







} else {
    resultsDiv.innerHTML = "<p>Няма намерени резултати за въведената дума. Првери за интервали в края на думата и ги премахни, ако са там. :)</p>";
}
document.getElementById("search-query").parentElement.remove();

